Revit 2026 API

# BlendSetVertexConnectionMap Method

---

Sets the mapping between the vertices in the top and bottom profiles.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void SetVertexConnectionMap(
	VertexIndexPairArray vertexMap
)
```
```vb
Public Sub SetVertexConnectionMap (
	vertexMap As VertexIndexPairArray
)
```
```cpp
public:
void SetVertexConnectionMap(
	VertexIndexPairArray^ vertexMap
)
```
```fsharp
member SetVertexConnectionMap :
        vertexMap : VertexIndexPairArray -> unit
```

#### Parameters

vertexMap VertexIndexPairArray

| Exception | Condition |
| --- | --- |
| ArgumentNullException | Thrown when the input argument-"vertexMap"-is . |
| ArgumentException | Thrown if the input argument-"vertexMap"-is empty. |
| InvalidOperationException | Thrown when the document failed to regenerate. |

#### Reference

Blend Class

Autodesk.Revit.DB Namespace